---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitType
source: html/370eb108-c9fd-be44-30ef-e0813854037f.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitType Property

The circuit type of the Electrical System.

## Syntax (C#)
```csharp
public CircuitType CircuitType { get; }
```

## Remarks
This read-only property is used to retrieve the circuit type of the Electrical System.